app/controllers/articles_controller.rb

      def create
        @article = Article.new(article_params)
        @article.save
---
INSERT INTO "articles" ("title", "user", "tech", "descrtion", "resolution", "catagory", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)